hrandib/stm8_libs/wake/wake_base.h
/*
 * Copyright (c) 2017-2022 Dmytro Shestakov
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

// Peripherals used: Uart, TIM4

#pragma once

#include "proto_version.h"
#include "wake_config.h"

#include "crc.h"
#include "flash.h"
#include "gpio.h"
#include "itc.h"
#include "timers.h"
#include "uart.h"

namespace Mcudrv {
namespace Wk {
//	---=== Operation time counter ===---
template<typename TCallback>
class OpTime
{
private:
    struct EepromBuf_t
    {
        uint16_t Dummy1;
        uint8_t Dummy2;
        uint8_t lvalue;
    };

#pragma data_alignment = 4
#pragma location = ".eeprom.noinit"
    static EepromBuf_t eebuf[16]; // @ ".eeprom.noinit";
#pragma data_alignment = 4
#pragma location = ".eeprom.noinit"
    static uint16_t hvalue; // @ ".eeprom.noinit";
    volatile static bool tenMinPassed;

    _Pragma(VECTOR_ID(TIM4_OVR_UIF_vector)) __interrupt static void UpdIRQ() // Fcpu/256/128 ~= 61 Hz for 2 MHz HSI
    {
        static uint16_t tempCounter;
        T4::Timer4::ClearIntFlag();
        if(++tempCounter == (600U * 61)) {
            tempCounter = 0;
            SetTenMinutesFlag();
        }
        TCallback::UpdIRQ();
    }
public:
#pragma inline = forced
    static void Init()
    {
        using namespace T4;
        Itc::SetPriority(TIM4_OVR_UIF_vector, Itc::prioLevel_2_middle);
        Timer4::Init(Div_128, CEN);
        Timer4::EnableInterrupt();
    }
#pragma inline = forced
    static bool GetTenMinitesFlag()
    {
        return tenMinPassed;
    }
#pragma inline = forced
    static void SetTenMinutesFlag()
    {
        tenMinPassed = true;
    }
#pragma inline = forced
    static void ClearTenMinutesFlag()
    {
        tenMinPassed = false;
    }
    static uint8_t GetIndex()
    {
        uint8_t i;
        for(i = 0; i < 15; i++) {
            if(eebuf[i + 1].lvalue != eebuf[i].lvalue + 1)
                break;
        }
        return i;
    }
    static void Get(volatile uint8_t* arr)
    {
        uint16_t temp = hvalue;
        arr[0] = eebuf[GetIndex()].lvalue;
        arr[1] = temp & 0xFF;
        arr[2] = temp >> 8UL;
    }

#pragma inline = forced
    static void CountInc()
    {
        using namespace Mem;
        uint8_t i = GetIndex();
        uint8_t tmp = eebuf[i].lvalue + 1;
        Unlock<Eeprom>();
        if(IsUnlocked<Eeprom>()) {
            if(i != 15)
                eebuf[i + 1].lvalue = tmp;
            else
                eebuf[0].lvalue = tmp;
            if(tmp == 0)
                ++hvalue;
        }
        Lock<Eeprom>();
    }
};

template<typename TCallback>
typename OpTime<TCallback>::EepromBuf_t OpTime<TCallback>::eebuf[16];
template<typename TCallback>
uint16_t OpTime<TCallback>::hvalue;
template<typename TCallback>
volatile bool OpTime<TCallback>::tenMinPassed;

//			---=== Wake main definitions ===---

enum
{
    DefaultADDR = 127,
    DefaultGroupADDR = 95,
    REBOOT_KEY = 0xCB47ED91U, // Host should use big endian format
    CRC_INIT = 0xDE,
    FEND = 0xC0,  // Frame END
    FESC = 0xDB,  // Frame ESCape
    TFEND = 0xDC, // Transposed Frame END
    TFESC = 0xDD  // Transposed Frame ESCape
};

enum Mode
{
    Master,
    Slave
};

enum State
{
    WAIT_FEND = 0, //ожидание приема FEND
    SEND_IDLE = 0, //состояние бездействия
    ADDR,          //ожидание приема адреса						//передача адреса
    CMD,           //ожидание приема команды						//передача команды
    NBT, //ожидание приема количества байт в пакете	//передача количества байт в пакете
    DATA, //прием данных								//передача данных
    CRC,  //ожидание окончания приема CRC				//передача CRC
    CARR  //ожидание несущей							//окончание передачи пакета
};

enum Cmd
{
    C_NOP,  //нет операции
    C_ERR,  //ошибка приема пакета
    C_ECHO, //передать эхо
    C_GETINFO,
    C_SETNODEADDRESS,
    C_GETGROUPADDRESS,
    C_SETGROUPADDRESS = C_GETGROUPADDRESS,
    C_GETOPTIME,
    C_OFF,
    C_ON,
    C_ToggleOnOff,
    C_SAVESETTINGS,
    C_REBOOT,

    C_BASE_END
};

enum Err
{
    ERR_NO,          // no error
    ERR_TX,          // Rx/Tx error
    ERR_BU,          // device busy error
    ERR_RE,          // device not ready error
    ERR_PA,          // parameters value error
    ERR_NI,          // Command not impl
    ERR_NR,          // no replay
    ERR_NC,          // no carrier
    ERR_ADDRFMT,     // new address is wrong
    ERR_EEPROMUNLOCK // EEPROM wasn't unlocked
};

enum DeviceType
{
    DevNull,
    DevLedDriver = 0x01,
    DevSwitch = 0x02,
    DevRgbDriver = 0x04,
    DevGenericIO = 0x08,
    DevSensor = 0x10,
    DevPowerSupply = 0x20,
    //		Reserved = 0x40,
    DevCustom = 0x80
};

enum CustomDeviceID
{
    CustomID_Themostat = 0x01
};

enum AddrType
{
    addrGroup,
    addrNode
};

// Each module must implement this interface
struct NullModule
{
    enum
    {
        deviceMask = DevNull,
        features = 0
    };
    static void Init()
    { }
    static void Process()
    { }
    static void SaveState()
    { }
    static void On()
    { }
    static void Off()
    { }
    static uint8_t GetDeviceFeatures(uint8_t)
    {
        return 0;
    }
    static void ToggleOnOff()
    { }
    static void UpdIRQ()
    { }
};

template<typename Module1,
         typename Module2 = NullModule,
         typename Module3 = NullModule,
         typename Module4 = NullModule,
         typename Module5 = NullModule,
         typename Module6 = NullModule>
struct ModuleList
{
    enum
    {
        deviceMask = (uint8_t)Module1::deviceMask | Module2::deviceMask | Module3::deviceMask | Module4::deviceMask |
                     Module5::deviceMask | Module6::deviceMask
    };
    static void Init()
    {
        Module1::Init();
        Module2::Init();
        Module3::Init();
        Module4::Init();
        Module5::Init();
        Module6::Init();
    }
    static void Process()
    {
        Module1::Process();
        Module2::Process();
        Module3::Process();
        Module4::Process();
        Module5::Process();
        Module6::Process();
    }
    static uint8_t GetDeviceFeatures(uint8_t deviceMask)
    {
        return deviceMask & Module1::deviceMask   ? Module1::GetDeviceFeatures(deviceMask)
               : deviceMask & Module2::deviceMask ? Module2::GetDeviceFeatures(deviceMask)
               : deviceMask & Module3::deviceMask ? Module3::GetDeviceFeatures(deviceMask)
               : deviceMask & Module4::deviceMask ? Module4::GetDeviceFeatures(deviceMask)
               : deviceMask & Module5::deviceMask ? Module5::GetDeviceFeatures(deviceMask)
               : deviceMask & Module6::deviceMask ? Module6::GetDeviceFeatures(deviceMask)
                                                  : 0;
    }
    static void SaveState() // module should be save only if settings changed
    {
        Module1::SaveState();
        Module2::SaveState();
        Module3::SaveState();
        Module4::SaveState();
        Module5::SaveState();
        Module6::SaveState();
    }
    static void On()
    {
        Module1::On();
        Module2::On();
        Module3::On();
        Module4::On();
        Module5::On();
        Module6::On();
    }
    static void Off()
    {
        Module1::Off();
        Module2::Off();
        Module3::Off();
        Module4::Off();
        Module5::Off();
        Module6::Off();
    }
    static void ToggleOnOff()
    {
        Module1::ToggleOnOff();
        Module2::ToggleOnOff();
        Module3::ToggleOnOff();
        Module4::ToggleOnOff();
        Module5::ToggleOnOff();
        Module6::ToggleOnOff();
    }
    static void UpdIRQ()
    {
        Module1::UpdIRQ();
        Module2::UpdIRQ();
        Module3::UpdIRQ();
        Module4::UpdIRQ();
        Module5::UpdIRQ();
        Module6::UpdIRQ();
    }
};

class WakeData
{
public:
    struct Packet
    {
        uint8_t addr;
        uint8_t cmd;
        uint8_t n;
        uint8_t buf[WAKEDATABUFSIZE];
    };
protected:
    static volatile Packet pdata;
    static volatile uint8_t cmd;
    static volatile uint8_t processedMask; // used to check if command processed in modules
};

template<typename moduleList = ModuleList<NullModule>,
         Uarts::BaudRate baud = 9600UL,
         typename DriverEnable = Pd6,
         Mode mode = Slave> // TODO: Master mode
class Wake : WakeData
{
private:
    typedef Uarts::Uart Uart;
    typedef OpTime<moduleList> OpTime;
#pragma location = ".eeprom.noinit"
    static volatile uint8_t nodeAddr_nv;
#pragma location = ".eeprom.noinit"
    static volatile uint8_t groupAddr_nv;
    static volatile uint8_t prev_byte;
    static volatile State state; // Current tranfer mode
    static volatile uint8_t ptr; // data pointer in Rx buffer
    static Crc::Crc8 crc;

    static void SetAddress(const AddrType nodeOrGroup) // and get address
    {
        if(pdata.n == 2 && pdata.addr) // data length correct and no broadcast
        {
            if(nodeOrGroup ? CheckNodeAddress() : CheckGroupAddress()) {
                using namespace Mem;
                uint8_t tempAddr = pdata.buf[0];
                pdata.buf[0] = ERR_NO;
                pdata.buf[1] = tempAddr;
                if(tempAddr != (nodeOrGroup ? nodeAddr_nv : groupAddr_nv)) // no write if address equal
                {
                    Unlock(Eeprom);
                    if(IsUnlocked(Eeprom)) {
                        if(nodeOrGroup)
                            nodeAddr_nv = tempAddr;
                        else
                            groupAddr_nv = tempAddr;
                    }
                    else
                        pdata.buf[0] = ERR_EEPROMUNLOCK;
                    Lock(Eeprom);
                }
            }
            else {
                pdata.buf[0] = ERR_ADDRFMT;
            }
        }
        else if(!pdata.n) // Get address
        {
            pdata.buf[0] = groupAddr_nv;
            pdata.n = 1;
        }
        else {
            pdata.buf[0] = ERR_PA;
            pdata.n = 2;
        }
        if(pdata.buf[0])
            pdata.buf[1] = 0;
    }
#pragma inline = forced
    static bool CheckNodeAddress()
    {
        uint8_t taddr = pdata.buf[0];
        return taddr == (~pdata.buf[1] & 0xFF) && ((taddr && taddr < 80) || (taddr > 112 && taddr < 128));
    }
#pragma inline = forced
    static bool CheckGroupAddress()
    {
        uint8_t taddr = pdata.buf[0];
        return taddr == (~pdata.buf[1] & 0xFF) && taddr > 79 && taddr < 96;
    }
public:
#pragma inline = forced

    static void Init()
    {
        using namespace Uarts;
        enum
        {
            SingleWireMode = (Uart::BaseAddr == UART1_BaseAddress && UART_SINGLEWIRE_MODE ? Uarts::SingleWireMode : 0)
        };
        Uart::template Init<Cfg(Uarts::DefaultCfg | Cfg(SingleWireMode)), baud>();
        DriverEnable::template SetConfig<GpioBase::Out_PushPull_fast>();
        DriverEnable::Clear();
        // validate node address saved in eeprom
        if(!nodeAddr_nv || nodeAddr_nv > 127) {
            Mem::Unlock(Mem::Eeprom);
            if(Mem::IsUnlocked(Mem::Eeprom)) {
                nodeAddr_nv = 127;
                Mem::Lock(Mem::Eeprom);
            }
        }
        moduleList::Init();
        OpTime::Init();
        Wdg::Iwdg::Enable(Wdg::P_1s);
        Uart::EnableInterrupt(IrqDefault);
    }
    static void Process()
    {
        using namespace Mem;
        Wdg::Iwdg::Refresh();
        if(OpTime::GetTenMinitesFlag() && !IsActive()) {
            OpTime::ClearTenMinutesFlag();
            OpTime::CountInc(); // Refresh optime counter every 10 mins
            Unlock<Eeprom>();
            if(IsUnlocked<Eeprom>()) {
                moduleList::SaveState(); // Save to EEPROM
                Lock<Eeprom>();
            }
        }
        if(cmd) {
            switch(cmd) {
                case C_NOP:
                case C_ECHO:
                    break;
                case C_ERR:
                    cmd = Wk::C_NOP;
                    return;
                case C_GETINFO:
                    // Common device info
                    if(!pdata.n) {
                        pdata.buf[0] = ERR_NO;
                        pdata.buf[1] = moduleList::deviceMask;
                        pdata.buf[2] = INSTRUCTION_SET_VER_MAJOR << 4 | INSTRUCTION_SET_VER_MINOR;
                        pdata.n = 3;
                    }
                    // Info about single logical device
                    else if(pdata.n == 1) {
                        if(pdata.buf[0] < 7) {
                            const uint8_t deviceMask = 1 << pdata.buf[0];
                            // Device is available
                            if(moduleList::deviceMask & deviceMask) {
                                pdata.buf[0] = ERR_NO;
                                pdata.buf[1] = moduleList::GetDeviceFeatures(deviceMask);
                                pdata.n = 2;
                            }
                            // device not available
                            else {
                                pdata.buf[0] = ERR_NI;
                            }
                        }
                        // else if(pdata.buf[0] == 7) //custom device
                    }
                    else {
                        pdata.buf[0] = ERR_PA;
                        pdata.n = 1;
                    }
                    break;
                case C_SETNODEADDRESS:
                    SetAddress(addrNode);
                    break;
                case C_SETGROUPADDRESS:
                    if(!pdata.n) {
                        pdata.n = 2;
                        pdata.buf[0] = ERR_NO;
                        pdata.buf[1] = groupAddr_nv;
                    }
                    else {
                        SetAddress(addrGroup);
                    }
                    break;
                case C_GETOPTIME:
                    if(!pdata.n) {
                        pdata.buf[0] = Wk::ERR_NO;
                        OpTime::Get(&pdata.buf[1]);
                        pdata.n = 4;
                    }
                    else {
                        pdata.buf[0] = Wk::ERR_PA;
                        pdata.n = 1;
                    }
                    break;
                case C_OFF:
                    if(!pdata.n) {
                        pdata.buf[0] = Wk::ERR_NO;
                        moduleList::Off();
                    }
                    else {
                        pdata.buf[0] = Wk::ERR_PA;
                    }
                    pdata.n = 1;
                    break;
                case C_ON:
                    if(!pdata.n) {
                        pdata.buf[0] = Wk::ERR_NO;
                        moduleList::On();
                    }
                    else {
                        pdata.buf[0] = Wk::ERR_PA;
                    }
                    pdata.n = 1;
                    break;
                case C_ToggleOnOff:
                    if(!pdata.n) {
                        pdata.buf[0] = Wk::ERR_NO;
                        moduleList::ToggleOnOff();
                    }
                    else {
                        pdata.buf[0] = Wk::ERR_PA;
                    }
                    pdata.n = 1;
                    break;
                case C_SAVESETTINGS:
                    if(!pdata.n) {
                        pdata.buf[0] = ERR_NO;
                        moduleList::SaveState();
                    }
                    else
                        pdata.buf[0] = ERR_PA;
                    pdata.n = 1;
                    break;
#if BOOTLOADER_EXIST
                case C_REBOOT:
                    if(pdata.n == 4 && *(uint32_t*)pdata.buf == REBOOT_KEY) {
                        System::Reset();
                    }
                    else {
                        pdata.buf[0] = Wk::ERR_PA;
                    }
                    pdata.n = 1;
                    break;
#else
                case C_REBOOT:
                    pdata.buf[0] = Wk::ERR_NI;
                    pdata.n = 1;
                    break;
#endif
                default:
                    moduleList::Process();
                    // Check if command not processed in modules
                    if(processedMask == moduleList::deviceMask) {
                        processedMask = 0;
                        pdata.buf[0] = Wk::ERR_NI;
                        pdata.n = 1;
                    }
            } // Switch
            uint8_t tempAddr = pdata.addr;
            if(tempAddr == nodeAddr_nv || tempAddr && cmd == C_SETNODEADDRESS) {
                Send();
            }
            cmd = Wk::C_NOP;
        }
    }

#pragma inline = forced
    static bool IsActive()
    {
        return state != WAIT_FEND;
    }

    static void Send()
    {
        using namespace Uarts;
        DriverEnable::Set(); // Switch to TX
        char data_byte = FEND;
        crc.Reset(CRC_INIT); //инициализация CRC,
        crc(data_byte);      //обновление CRC
        Uart::Regs()->DR = data_byte;
        state = ADDR;
        prev_byte = TFEND;
        Uart::DisableInterrupt(IrqRxne);
        Uart::EnableInterrupt(IrqTxEmpty);
    }

