hrandib/stm8_libs/wake/wake_base.h
#if defined(STM8S103) || defined(STM8S003)
    _Pragma(VECTOR_ID(UART1_T_TXE_vector))
#elif defined(STM8S105)
    _Pragma(VECTOR_ID(UART2_T_TXE_vector))
#endif
      __interrupt static void TxISR()
    {
        using namespace Uarts;
        if(Uart::IsEvent(EvTxComplete)) {
            Uart::ClearEvent(EvTxComplete);
            Uart::ClearEvent(EvRxne);
            Uart::EnableInterrupt(IrqRxne);
            DriverEnable::Clear(); // Switch to RX
        }
        else { // if(Uart::IsEvent(Uarts::TxEmpty))
            uint8_t data_byte;
            if(prev_byte == FEND) {
                data_byte = TFEND; //передача TFEND вместо FEND
                prev_byte = data_byte;
                Uart::Regs()->DR = data_byte;
                return;
            }
            if(prev_byte == FESC) {
                data_byte = TFESC; //передача TFESC вместо FESC
                prev_byte = data_byte;
                Uart::Regs()->DR = data_byte;
                return;
            }
            switch(state) {
                case ADDR: //-----> передача адреса
                    state = CMD;
                    if(pdata.addr) {
                        data_byte = nodeAddr_nv | 0x80; //то он передается (бит 7 равен единице)
                        break;
                    }
                    //иначе сразу передаем команду
                case CMD:
                    data_byte = pdata.cmd & 0x7F;
                    state = NBT;
                    break;
                case NBT: //-----> передача количества байт
                    data_byte = pdata.n;
                    state = DATA;
                    ptr = 0; //обнуление указателя данных для передачи
                    break;
                case DATA: { //-----> передача данных
                    uint8_t ptr_ = ptr;
                    if(ptr_ < pdata.n) {
                        data_byte = pdata.buf[ptr++];
                    }
                    else {
                        data_byte = crc.GetResult(); //передача CRC
                        state = CRC;
                    }
                    break;
                }
                default:
                    Uart::DisableInterrupt(IrqTxEmpty);
                    state = SEND_IDLE; //передача пакета завершена
                    return;
            }
            crc(data_byte);        //обновление CRC
            prev_byte = data_byte; //сохранение пре-байта
            if(data_byte == FEND)  // || data_byte == FESC)
                data_byte = FESC;  //передача FESC, если нужен стаффинг
            Uart::Regs()->DR = data_byte;
        }
    }

#if defined(STM8S103) || defined(STM8S003)
    _Pragma(VECTOR_ID(UART1_R_RXNE_vector))
#elif defined(STM8S105)
    _Pragma(VECTOR_ID(UART2_R_RXNE_vector))
#endif
      __interrupt static void RxISR()
    {
        using namespace Uarts;
        bool error = Uart::IsEvent(static_cast<Events>(EvParityErr | EvFrameErr | EvNoiseErr | EvOverrunErr));
        uint8_t data_byte = Uart::Regs()->DR;
        if(error) {
            state = WAIT_FEND; //ожидание нового пакета
            cmd = C_ERR;       //рапортуем об ошибке
            return;
        }
        if(data_byte == FEND) {
            prev_byte = data_byte;
            crc.Reset(CRC_INIT);
            state = ADDR;
            crc(data_byte);
            return;
        }
        if(state == WAIT_FEND) {
            return;
        }
        char Pre = prev_byte;  //сохранение старого пре-байта
        prev_byte = data_byte; //обновление пре-байта
        if(Pre == FESC) {
            if(data_byte == TFESC)      //а байт данных равен TFESC,
                data_byte = FESC;       //то заменить его на FESC
            else if(data_byte == TFEND) //если байт данных равен TFEND,
                data_byte = FEND;       //то заменить его на FEND
            else {
                state = WAIT_FEND; //для всех других значений байта данных,
                cmd = C_ERR;       //следующего за FESC, ошибка
                return;
            }
        }
        else {
            if(data_byte == FESC) //если байт данных равен FESC, он просто
                return;           //запоминается в пре-байте
        }
        switch(state) {
            case ADDR: //-----> ожидание приема адреса
                if(data_byte & 0x80) {
                    crc(data_byte);    //то обновление CRC и
                    data_byte &= 0x7F; //обнуляем бит 7, получаем истинный адрес
                    if(data_byte == 0 || data_byte == nodeAddr_nv || data_byte == groupAddr_nv) {
                        pdata.addr = data_byte;
                        state = CMD; //переходим к приему команды
                        break;
                    }
                    state = WAIT_FEND; //адрес не совпал, ожидание нового пакета
                    break;
                }
                else
                    pdata.addr = 0; //если бит 7 данных равен нулю, то
                state = CMD;        //сразу переходим к приему команды
            case CMD:               //-----> ожидание приема команды
                if(data_byte & 0x80) {
                    state = WAIT_FEND; //если бит 7 не равен нулю,
                    cmd = C_ERR;       //то ошибка
                    break;
                }
                pdata.cmd = data_byte; //сохранение команды
                crc(data_byte);        //обновление CRC
                state = NBT;           //переходим к приему количества байт
                break;
            case NBT:
                if(data_byte > WAKEDATABUFSIZE) {
                    state = WAIT_FEND;
                    cmd = C_ERR; //то ошибка
                    break;
                }
                pdata.n = data_byte;
                crc(data_byte); //обновление CRC
                ptr = 0;        //обнуляем указатель данных
                state = DATA;   //переходим к приему данных
                break;
            case DATA:
                uint8_t ptr_ = ptr;
                if(ptr_ < pdata.n) {
                    pdata.buf[ptr++] = data_byte; //то сохранение байта данных,
                    crc(data_byte);               //обновление CRC
                    break;
                }
                if(data_byte != crc.GetResult()) {
                    state = WAIT_FEND; //если CRC не совпадает,
                    cmd = C_ERR;       //то ошибка
                    break;
                }
                state = WAIT_FEND; //прием пакета завершен,
                cmd = pdata.cmd;   //загрузка команды на выполнение
                break;
        }
    }
};

template<typename moduleList, Uarts::BaudRate baud, typename DEpin, Mode mode>
volatile uint8_t Wake<moduleList, baud, DEpin, mode>::nodeAddr_nv; // = 127;
template<typename moduleList, Uarts::BaudRate baud, typename DEpin, Mode mode>
volatile uint8_t Wake<moduleList, baud, DEpin, mode>::groupAddr_nv; // = 95;
template<typename moduleList, Uarts::BaudRate baud, typename DEpin, Mode mode>
volatile uint8_t Wake<moduleList, baud, DEpin, mode>::prev_byte;
template<typename moduleList, Uarts::BaudRate baud, typename DEpin, Mode mode>
volatile State Wake<moduleList, baud, DEpin, mode>::state;
template<typename moduleList, Uarts::BaudRate baud, typename DEpin, Mode mode>
volatile uint8_t Wake<moduleList, baud, DEpin, mode>::ptr;
template<typename moduleList, Uarts::BaudRate baud, typename DEpin, Mode mode>
Crc::Crc8 Wake<moduleList, baud, DEpin, mode>::crc;
} // Wk
} // Mcudrv
